

# برنامه ای بنویس که  فرد یه جمله وارد  کنه و برنامه حمله رو برعکس بنویسه  1-




















# 2  برنامه ای بنویس که اعداد زوج و فرد رو از ۱ تا ۳۰۰ بشمره و بگه جندد تا عدد زوج و فرد وجود داره بین ۱ تا ۳۰۰ 





















# 3 برنامه ای  بنویس که از قرد یخواد یه پسورد وارد کنه و  بعد از وارد شدن پسورد برنامه چک کنه که این پسورد 
# حتما  کمتر از ۷ و بیشتر از ۱۰ نباشه 
# جتما دربین  این ۷ الی ۱۰ تا از اعداد استفاده بشه ... از حروف کوچیک و بزرگ استفاده شده باشه 
# و جک کنه که بیشتر از ۱۰ تا نباشه  و 
# از [$#@] حتما استفاده کرده باشه 
    
           
           
           
           
           
           
           
           
           
           
    
#  4    این شکل رو درست کن 
#   ***                                                                   
#  *   *                                                                  
#  *   *                                                                  
#  *****                                                                  
#  *   *                                                                  
#  *   *                                                                  
#  *   *
 
 
 
 
 
 
 
 
 
 
 
 
 
 
 
 
 
 
# 5  این ها رو درست کن  
 
#    ****                                                                  
#  *                                                                      
#  *                                                                      
#   ***                                                                   
#      *                                                                  
#      *                                                                  
#  **** 
 
#  ooooooooooooooooo                                                       
# ooooooooooooooooo                                                       
# ooooooooooooooooo                                                       
# oooo                                                                    
# oooo                                                                    
# oooo                                                                    
# ooooooooooooooooo                                                       
# ooooooooooooooooo                                                       
# ooooooooooooooooo                                                       
#              oooo                                                       
#              oooo                                                       
#              oooo                                                       
# ooooooooooooooooo                                                       
# ooooooooooooooooo                                                       
# ooooooooooooooooo 















# 6 این رو درست کن 

# 1
# 22
# 333
# 4444
# 55555
# 666666
# 7777777
# 88888888
# 999999999





# 7 برنامه ای بنویس که از فرد جمله بخواد و حروف حمله ها رو بشمره و بگه چقدر خروف در این حمله هست 
# و در ادامه برنامه ای بنویس که تعداد خروف تکراری رو هم بشمره  مثلا برنامه بشمره چند تا   A ای  و   B  بی بکار رفته 



